Repository: spokwn/JournalTrace
Catalog: JournalTrace/Language/Localization/*.resx
Languages: pt

source: Clear
pt: Limpar

source: Copy
pt: Copiar

# countall
source: Quantity of entries:
pt: Quantidade de entradas:

# countdirectories
source: Directories:
pt: Diretórios:

# countfiles
source: Files:
pt: Arquivos:

# countfirst
source: Oldest entry:
pt: Entrada mais antiga:

source: Current file
pt: Arquivo atual

source: Data Grid
pt: Grade de dados

source: Date
pt: Data

source: Directory
pt: Diretório

source: Directory Tree
pt: Arvore de diretórios

source: Drive
pt: Disco

# enterdir
source: Enter entry directory
pt: Entrar no diretório da entrada

# entryinfo
source: Show file information
pt: Mostrar informações do arquivo

source: Export
pt: Exportar

source: File
pt: Arquivo

# filedeleted
source: File was deleted
pt: Arquivo foi deletado

# fileid
source: File Identification
pt: Identificador do arquivo

source: Format
pt: Formato

# formdrive
source: Drive selection
pt: Seleção de disco

# formentryinfo
source: Entry information
pt: Informações da entrada

# info
source: Information
pt: Informação

source: Language
pt: Lingua

# lbUsnJrnl
source: last modification $UsnJrnl:$J
pt: última modificação $UsnJrnl:$J

# lordyzagatdesc
source: Idea for the project, translated reasons
pt: Ideia para o projeto, traduziu razões

source: Name
pt: Nome

# nolandesc
source: OpenByFileId Win32 API wrapper for C#
pt: OpenByFileId Win32 API compatibilização para C#

# poneidesc
source: Main developer
pt: Desenvolvedor principal

source: Reason
pt: Razão

source: Root
pt: Raiz

source: Scan
pt: Escanear

source: Search
pt: Pesquisar

source: Select
pt: Selecionar

# skipperdesc
source: NTFS UsnJournal Win32 API wrapper for C#
pt: NTFS UsnJournal Win32 API compatibilização para C#

# statusdesc-1
source: The program couldn't create a handle to the selected drive, to query the current journal state.
pt: O programa não conseguiu manejar o disco selecionado, para consultar o estado atual do journal.

# statusdesc-2
source: The program couldn't query the current state of the journal. Make sure the selected drive has journaling enabled.
pt: O programa não conseguiu consultar o estado atual do journal. Certifique-se de que o disco selecionado tenha o journal habilitado.

# statusdesc-3
source: The program couldn't call DeviceIoControl properly to return all the journal entries in the drive.
pt: O programa não conseguiu chamar o DeviceIoControl corretamente para retornar todos as entradas do journal do disco.

# statusdesc-4
source: The program couldn't resolve file ID's properly. Is something blocking the program?
pt: O programa não conseguiu resolver as identificações dos arquivos corretamente. Algo está bloqueando o programa?

# statusdesc-5
source: The program couldn't parse journal entries correctly. This could be the program's fault.
pt: O programa não conseguiu analisar corretamente as entradas do journal corretamente. Isto pode ser culpa do programa.

# statusdesc0
source: Please select the desired drive and start filtering journal entries.
pt: Por favor, selecione o disco desejado e incie a filtragem do journal.

# statusdesc1
source: To query the journal, we have to make sure we can create handles to it without problems.
pt: Para consultar o journal, temos que ter certeza de que podemos criar handles sem problemas.

# statusdesc2
source: We need to query the current state of the journal to get it's values.
pt: Precisamos consultar o estado atual do journal para obter seus valores.

# statusdesc3
source: Calling DeviceIoControl to give us all the entries in the current journal ID.
pt: Chamando de DeviceIoControl para nos dar todas as entradas do ID do journal atual.

# statusdesc4
source: File ID's aren't human readable paths, so we need to resolve all the possible ones.
pt: Os ID's dos arquivos não são caminhos legíveis por humanos, então precisamos resolver todos os possíveis.

# statusdesc5
source: Parsing all journal entries into classes that we will modify and query later.
pt: Transformando todas as entradas de journal em classes que modificaremos e consultaremos mais tarde.

# statusdesc6
source: Select a layout type to view the collected data. Each will visualize data on a different way.
pt: Selecione um tipo de layout para visualizar os dados coletados. Cada um mostrará os dados de uma maneira diferente.

# statusgrid0
source: Parsing journal entries to rows...
pt: Transformando entradas em fileiras...

# statusgrid1
source: Adding rows to control...
pt: Adicionando fileiras à grade...

# statustitle-1
source: Couldn't get handle to volume.
pt: Não foi possível manejar o disco selecionado.

# statustitle-2
source: Couldn't get current journal state.
pt: Não foi possível retornar o estado atual do journal.

# statustitle-3
source: Couldn't query journal entries.
pt: Não foi possível consultar as entradas do journal.

# statustitle-4
source: Couldn't resolve ID's.
pt: Não foi possível resolver os ID's.

# statustitle-5
source: Couldn't parse entries.
pt: Não foi possível analisar as entradas.

# statustitle0
source: Waiting input...
pt: Aguardando entrada...

# statustitle2
source: Getting current journal state...
pt: Obtendo o estado atual do journal...

# statustitle3
source: Querying journal entries...
pt: Consultando as entradas do journal...

# statustitle4
source: Resolving file ID's...
pt: Resolvendo identificações de arquivos...

# statustitle5
source: Parsing entries...
pt: Analisando entradas...

# statustitle6
source: All done!
pt: Tudo pronto!

source: Total free space
pt: Espaço total livre

source: Total size
pt: Espaço total

source: Type
pt: Tipo

# usnreasons
source: Data overwrite,Data extend,Data truncation,Named data overwrite,Named data extend,Named data truncation,File create,File delete,EA Change,Security change,Rename: old name,Rename: new name,Indexable change,Basic info change,Hard link change,Compression change,Encryption change,Object ID change,Reparse point change,Stream change,Close
pt: Substituição de dados,Extensão de dados,Truncagem de dados,Substituição de dados nomeados,Extensão de dados nomeados,Truncagem de dados nomeados,Criação de arquivo,Exclusão de arquivo,Alteração de EA,Alteração de segurança,Renomear: nome antigo,Renomear: novo nome,Alteração de indexável,Alteração de informações básicas,Alteração de link físico,Alteração de compressão,Alteração de criptografia,Alteração de ID de objeto,Alteração do ponto de nova análise,Alteração de fluxo,Fechar
